Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input (InputLayer)              [(None, 224, 224, 3) 0                                            
__________________________________________________________________________________________________
vgg19 (Model)                   (None, 7, 7, 512)    20024384    input[0][0]                      
__________________________________________________________________________________________________
flatten (Flatten)               (None, 25088)        0           vgg19[1][0]                      
__________________________________________________________________________________________________
dropout (Dropout)               (None, 25088)        0           flatten[0][0]                    
__________________________________________________________________________________________________
cc3 (Dense)                     (None, 5)            125445      dropout[0][0]                    
__________________________________________________________________________________________________
tags (Dense)                    (None, 3)            75267       dropout[0][0]                    
==================================================================================================
Total params: 20,225,096
Trainable params: 200,712
Non-trainable params: 20,024,384
__________________________________________________________________________________________________
