Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input (InputLayer)              [(None, 301, 217, 3) 0                                            
__________________________________________________________________________________________________
vgg16 (Model)                   (None, 9, 6, 512)    14714688    input[0][0]                      
__________________________________________________________________________________________________
flatten (Flatten)               (None, 27648)        0           vgg16[1][0]                      
__________________________________________________________________________________________________
dropout (Dropout)               (None, 27648)        0           flatten[0][0]                    
__________________________________________________________________________________________________
cc3 (Dense)                     (None, 5)            138245      dropout[0][0]                    
__________________________________________________________________________________________________
tags (Dense)                    (None, 3)            82947       dropout[0][0]                    
==================================================================================================
Total params: 14,935,880
Trainable params: 221,192
Non-trainable params: 14,714,688
__________________________________________________________________________________________________
